Revit 2027 API
ThermalAsset.GasViscosity Property
 The gas viscosity of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GasViscosity { get; set; }
Public Property GasViscosity As Double
	Get
	Set
public:
property double GasViscosity {
	double get ();
	void set (double value);
}
member GasViscosity : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for gasViscosity must be non-negative.
InapplicableDataException |  When setting this property: the asset must be gas to set this property.
Remarks
 Values are in kilograms per feet-second (kg/(ft · s)) and must be non-negative.
See Also
Reference
ThermalAsset Class
Autodesk.Revit.DB Namespace